{
  "Études": [
    {
      "title": "Développeur Javascript/React RNCP 35976 niveau 6",
      "time": "Juin 2023 - Juillet 2024",
      "description": "Formation en ligne spécialisée dans le développement d'applications web avec React. Acquisition de compétences en JavaScript, React, Redux, et création d'interfaces utilisateur réactives. Formation pratique incluant des projets réels et un mentorat personnalisé pour maîtriser les outils et les meilleures pratiques du développement front-end moderne.",
      "points": []
    },
    {
      "title": "BTS Services Informatiques aux Organisations spécialité Solutions Logicielles et Applications Métier",
      "time": "Septembre 2014 - Juillet 2015",
      "description": "Formation de niveau bac+2 spécialisée en informatique, avec un focus sur les solutions logicielles et applications métiers. Acquisition de compétences en développement de logiciels et applications, administration, sécurité, et support informatique pour les entreprises.",
      "points": []
    },
    {
      "title": "Bac  Sciences et Technologies de l'Industrie, spécialité électrotechnique",
      "time": "Juillet 2011",
      "description": "Formation technologique axée sur l’électricité, l’électronique et l’automatisation, avec une approche pratique des systèmes industriels et énergétiques.",
      "points": []
    }
  ],
  "Expériences Professionnelles": [
    {
      "title": "Lifis.fr - Dévelopeur Full-stack",
      "time": "Janvier 2025 – Juillet 2025 (7 mois)",
      "description": "",
      "points": [
        "Développement de l’API RESTful avec NestJS",
        "Documentation des APIs avec Swagger (OpenAPI)",
        "Mise en place et sécurisation des tokens JWT pour l’authentification",
        "Backend désigné en architecture hexagonale",
        "Intégration des maquettes Figma dans React",
        "Communication avec l’API",
        "Tests unitaires et d’intégrations avec Jest et NightWatch",
        "Collaboration en méthodologie agile (SCRUM)",
        "Participation aux code reviews et pair programming",
        "Rédaction du cahier des charges pour le mode SCI",
        "Rédaction de la documentation technique"
      ]
    }
  ],
  "Projet personnel": [
    {
      "title": "LANRumble.com – SaaS pour la communauté gaming",
      "time": "2015 - Présent",
      "description": "",
      "points": [
        "Conception d’API RESTful avec Django",
        "Documentation de l’API avec Swagger (OpenAPI 3)",
        "Frontend conçu from scratch",
        "Communication avec l’API",
        "Gestion de base de données relationnelles",
        "Responsable du hardware ainsi que du software",
        "Build de l’image du site avec Docker",
        "Feedbacks utilisateurs intégrés en itération agile (kanban)"
      ]
    }
  ]
}
